<a href="https://colab.research.google.com/github/AlexPam/AlexPam.github.io/blob/master/ALEX_Pam_Data_Preprocessing-ASSIGNMENT.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

---
# Lambda School Data Science - Intro to Pandas
---
# 05 - Cleaning Data
---

##STOP! BEFORE GOING ANY FURTHER...  


1. Click "File" at the top.
2. Then, "Save a Copy in Drive."
3. Change the file name to "FIRSTNAME_LASTNAME_1_2"  

Now you have a copy of this notebook in your Drive account. This is the copy you'll edit and submit. Be sure to do this for ***every*** assignment!

### Import pandas

In [ ]:
import pandas as pd

### Import the data in the CSV file
You can find the data [here](https://raw.githubusercontent.com/axrd/datasets/master/gdpmessy2.csv). Should have a shape of (222,3). Use this [resource](https://www.iban.com/country-codes) to clean values correctly.

In [ ]:
df = pd.read_csv('https://raw.githubusercontent.com/axrd/datasets/master/gdpmessy2.csv')

### Quickly inspect the head

In [ ]:
df.head()

   Unnamed: 0        countrys     GDP code
0           0     Afghanistan   21.71  AFG
1           1         Albania   13.40  ALB
2           2         Algeria  227.80  DZA
3           3  American Samoa    0.75  ASM
4           4         Andorra    4.80  AND

### Inspect the tail

In [ ]:
df.tail()

     Unnamed: 0             countrys    GDP code
217         217  U.S. Virgin Islands   5.08  VIR
218         218            West Bank   6.64  WBG
219         219                Yemen  45.45  YEM
220         220               Zambia  25.61  ZMB
221         221             Zimbabwe  13.74  ZMB

### What is the shape of the DataFrame? Does it correspond to what we expected?

In [ ]:
df.shape

(222, 4)

### Do you need to change the index?

In [ ]:
#Yes I think removing the Unnamed:0 column would be useful
df.drop('Unnamed: 0', axis=1, inplace=True)

### Missing values?
Find all the missing values and correct them.

In [ ]:
df[df.isnull().any(axis=1)]

         countrys     GDP code
6             NaN    0.18  AIA
14   Bahamas, The    8.65  NaN
16     Bangladesh     NaN  BGD
20            NaN    1.67  BLZ
55        Denmark  347.20  NaN
70         France     NaN  FRA
90        Hungary  129.70  NaN
96        Ireland     NaN  IRL
100       Jamaica   13.92  NaN
106           NaN    0.16  KIR
200          Togo    4.84  NaN
206           NaN    0.04  TUV

In [ ]:
df.at[6,"countrys"] = "Anguilla"
df.at[14,"code"] = "BHS"
df.at[16,"GDP"] = 180.60
df.at[55,"code"] = "DNK"
df.at[70,"GDP"] = 2902.0
df.at[90,"code"] = "HUN"
df.at[96,"GDP"] = 186.60
df.at[100,"code"] = "JAM"
df.at[106,"countrys"] = "Kiribati"
df.at[200,"code"] = "TGO"
df.at[206,"countrys"] = "Kiribati"

In [ ]:
df

                countrys     GDP code
0            Afghanistan   21.71  AFG
1                Albania   13.40  ALB
2                Algeria  227.80  DZA
3         American Samoa    0.75  ASM
4                Andorra    4.80  AND
..                   ...     ...  ...
217  U.S. Virgin Islands    5.08  VIR
218            West Bank    6.64  WBG
219                Yemen   45.45  YEM
220               Zambia   25.61  ZMB
221             Zimbabwe   13.74  ZMB

[222 rows x 3 columns]

### Find duplicate values  
Clean where necessary:  
*   France has a GDP of 2902.0 billion.
*   Ireland has a GDP of 245.80 billion.
*   Bangladesh has a GDP of 186.60 billion.

In [ ]:
df['countrys'].value_counts(sort=True).head()

Kiribati    2
Rwanda      1
Malta       1
Somalia     1
Spain       1
Name: countrys, dtype: int64

In [ ]:
df[df['countrys']=='Kiribati']

     countrys   GDP code
106  Kiribati  0.16  KIR
206  Kiribati  0.04  TUV

In [ ]:
df.at[206,'countrys'] = 'Tuvana'

In [ ]:
df['code'].value_counts(sort=True).head()

ZMB    2
ARG    2
CHN    1
LKA    1
QAT    1
Name: code, dtype: int64

In [ ]:
df[df['code']=='ZMB']

     countrys    GDP code
220    Zambia  25.61  ZMB
221  Zimbabwe  13.74  ZMB

In [ ]:
df.at[221,'code'] = 'ZWE'

In [ ]:
df[df['code']=='ARG']

                 countrys    GDP code
8               Argentina  536.2  ARG
209  United Arab Emirates  416.4  ARG

In [ ]:
df.at[209,'code'] = 'ARE'
df

                countrys     GDP code
0            Afghanistan   21.71  AFG
1                Albania   13.40  ALB
2                Algeria  227.80  DZA
3         American Samoa    0.75  ASM
4                Andorra    4.80  AND
..                   ...     ...  ...
217  U.S. Virgin Islands    5.08  VIR
218            West Bank    6.64  WBG
219                Yemen   45.45  YEM
220               Zambia   25.61  ZMB
221             Zimbabwe   13.74  ZWE

[222 rows x 3 columns]

### Verify the change persisted!

In [ ]:
df

                countrys     GDP code
0            Afghanistan   21.71  AFG
1                Albania   13.40  ALB
2                Algeria  227.80  DZA
3         American Samoa    0.75  ASM
4                Andorra    4.80  AND
..                   ...     ...  ...
217  U.S. Virgin Islands    5.08  VIR
218            West Bank    6.64  WBG
219                Yemen   45.45  YEM
220               Zambia   25.61  ZMB
221             Zimbabwe   13.74  ZWE

[222 rows x 3 columns]

### Submit your assignment notebook! (Make sure you've changed the name to FIRSTNAME_LASTNAME_1_2): 

1.  Click the Share button in the upper-right hand corner of the notebook.
2.  Get the shareable link.
3.  Set condition to: "Anyone with the link can comment."
4.  TBD 


---